src/tests/load/test.yml
config:
  target: "http://0.0.0.0:3000"
  phases:
    - duration: 30
      arrivalRate: 100
      name: "Load Test"
  processor: "./test.js"
  ensure:
    p99: 50

scenarios:
  - name: "Ride API"
    flow:
      - post:
          url: "/rides"
          beforeRequest: generateCreateData
          json:
            start_lat: "{{ start_lat }}"
            start_long: "{{ start_long }}"
            end_lat: "{{ end_lat }}"
            end_long: "{{ end_long }}"
            rider_name: "{{ rider_name }}"
            driver_name: "{{ driver_name }}"
            driver_vehicle: "{{ driver_vehicle }}"
          capture:
            - json: "$.id"
              as: "id"
          weight: 1
      - get:
          url: "/rides/{{ id }}"
          weight: 1
      - get:
          url: "/rides"
          weight: 1